# LEARNING AGGREGATIONS

# AGGREGATION SUM
# adding all values in price with the condition in the WHERE clause
SELECT SUM(price) as total_discount_price
FROM products
WHERE price<=10

# what is the difference between doing this and a group by ???

# AGGREGATION AVERAGE

# it will ignore rows with the NULL and exclude it from the count to generate the average

student_id	score
1	70
2	NULL
3	75
4	65

so the average of this would be (70+75+65)/3

# HOWEVER if we want to include the NULL values into the average, we can do
# the COUNT(*) includes values that are NULL
SUM(score) / COUNT(*) as this will give (70+75+65)/4

# to convert the value from FLOATING POINT into an INT
# use the ROUND clause
ROUND(AVG(score))

SELECT ROUND(AVG(score)) as average_math_score
FROM scores
WHERE subject='math'

# AGGREATION COUNT

# the counts function counts all rows that match the condition including duplicates
# to remove duplicates use the DISTINCT clause
 

# includes rows that have NULL values
SELECT COUNT(*) 

# but if we use use a columns in the COUNT, it will exclude NULL values
SELECT COUNT(tweet_id)

# LENGTH can be used to count the length of the string
SELECT COUNT(DISTINCT(author)) as unique_authors
FROM books
WHERE LENGTH(author) <12;

# alterantively, this ensures that each author minimally must have 12 characters
SELECT COUNT(DISTINCT(author)) as unique_authors
FROM books
WHERE author NOT LIKE '____________%';

# AGGREGATION MIN MAX

# MIN and MAX and COUNT can be used all together in the same query

SELECT ROUND(MIN(score)) as min_score, 
ROUND(MAX(score)) as max_score, 
ROUND(AVG(score)) as avg_score
FROM scores
WHERE region='EU';

# AGGREGATIION GROUP BY

# if we have a table of books, we could get the number of books for a specific author like this
SELECT COUNT(*)
FROM books
WHERE author = 'John Doe'

# but if we want to get the number of books for every author, we can use the GROUP BY clause
SELECT author, COUNT(*)
FROM books
GROUP BY author

# it can be used togethere with other aggregation methods
SELECT country, SUM(gold) as gold_medals, 
SUM(silver) as silver_medals,
SUM(bronze) as bronze_medals
FROM olympic_medals
GROUP BY country

# GROUP BY MULTIPLE

# group by can also be done with a combination of multiple columns
# this will give you a combination 

student_id	course_name	semester	grade
1	Math	2023-Fall	85
1	Science	2023-Fall	90
1	Math	2024-Spring	88
1	Science	2024-Spring	92
2	Math	2023-Fall	78
2	Science	2023-Fall	85
2	Math	2024-Spring	80

SELECT course_name, semester, AVG(grade)
FROM grades

GROUP BY course_name, semester;

# this is interchangable with, since it just returns all combination it is able to find
GROUP BY semester, course_name;

# this will give all combination of course_name and semester and the average grade of each 
course_name	semester	AVG(grade)
Math	2023-Fall	81.5
Science	2023-Fall	87.5
Math	2024-Spring	84.0
Science	2024-Spring	92.0

# to deduplicate a list of authors we can either use the DISTINCT clause or the GROUP BY

SELECT DISTINCT author
FROM books

# or

# since this groups each author together
SELECT author
FROM books
GROUP BY author

# AGGREGATION HAVING
# this is used together with the GROUP BY CLAUSE
# It is mainly used to filter the results of a GROUP BY clause

SELECT book_name
FROM book_sales
GROUP BY book_name
HAVING SUM(copies_sold) > 500;

# AGGREGATION EXECUTION ORDER

SELECT book_name
FROM book_sales
WHERE book_name LIKE 'A%'
GROUP BY book_name
HAVING SUM(copies_sold) > 100
ORDER BY book_name
LIMIT 1;

# based off this query

# the FROM is slected first
# then the WHERE

# then the GROUP BY
# and then the HAVING SUM

# followed by the ORDER BY
# then the LIMIT of 1 

# and finally the SELECT


SELECT country, year, SUM(gold + silver + bronze) as total_medals
FROM olympic_medals 
WHERE category != 'Gymnastics'
GROUP BY country, year
HAVING SUM(gold + silver + bronze) >20

# ORDER BY can use the alias defined in the SELECT clause
ORDER BY total_medals DESC
LIMIT 5;